lecture_code/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = 10 LIMIT 1
---
  def show
    @movie = Movie.find_by_id(params[:id])

INSERT INTO "movies" ("title", "year") VALUES (?, ?)  [["title", "ET"], ["year", 185]]
---
  def create
    @movie = Movie.new
    @movie.title = params[:movie][:title]
    @movie.year = params[:movie][:year]
    if @movie.save

SELECT "movies".* FROM "movies" WHERE "movies"."id" = 1 LIMIT 1
---
  def edit
    @movie = Movie.find_by_id(params[:id])

SELECT "movies".* FROM "movies" WHERE "movies"."id" = 4 LIMIT 1
UPDATE "movies" SET "year" = 1979 WHERE "movies"."id" = 4
---
  def update
    @movie = Movie.find_by_id(params[:id])
    @movie.title = params[:title]
    @movie.year = params[:year]
    @movie.save

SELECT "movies".* FROM "movies" WHERE "movies"."id" = 3 LIMIT 1
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 3]]
---
  def destroy
    m = Movie.find_by_id(params[:id])
    m.destroy